package mini.plural;

/**
 * TODO
 */
public class Dictionary {
    public static final Word[] WORDS = new Word[]{

            // Время. Для миллисекунд и менее можно использовать префикс + "секунда"
            w("секунда", "секунды", "секунд"),
            w("минута", "минуты", "минут"),
            w("час", "часа", "часов"),
            w("день", "дня", "дней"),
            w("неделя", "недели", "недель"),
            w("месяц", "месяца", "месяцев"),
            w("квартал", "квартала", "кварталов"),
            w("год", "года", "лет"),
            w("десятилетие", "десятилетия", "десятилетий"),
            w("столетие", "столетия", "столетий"),
            w("век", "века", "веков"),
            w("тысячилетие", "тысячилетия", "тысячилетий"),

            // другие полезные слова
            w("пользователь", "пользователя", "пользователей"),
            w("клиент", "клиента", "клиентов"),
            w("попытка", "попытки", "попыток")
    };

    public static Word w(String f1, String f2, String f3) {
        return new Word(new String[]{f1, f2, f3});
    }
}
